ZeroZap/BareOS/project/PLB -N32/USER/src/n32l40x_cfg.c
/**
 * @file n32l40x_cfg.c
 * @author N32cube
 */

#include "n32l40x_cfg.h"
#include "xy_hal.h"
#include "xy_hal_n32l40x.h"
#include "xy_rb.h"
#include <stdio.h>
/* NTFx CODE START */
__IO uint32_t mwTick;
volatile uint32_t g_n32_debug_log_tx_count;
volatile uint8_t g_n32_debug_log_last_char;
volatile uint32_t g_n32_uart5_rx_count;
volatile uint32_t g_n32_uart5_tx_count;
volatile uint32_t g_n32_uart5_rx_drop_count;
volatile uint32_t g_n32_uart5_rb_pending;
volatile uint8_t g_n32_uart5_last_rx;
static xy_rb_t s_uart5_rx_rb;
static uint8_t s_uart5_rx_pool[128];
static uint32_t s_n32_lptim_clock_hz;

#ifndef PLB_N32_LSI_HZ
#define PLB_N32_LSI_HZ 40000u
#endif

uint32_t n32_lptim_clock_hz(void)
{
    return s_n32_lptim_clock_hz;
}

uint32_t n32_lptim_max_timeout_ms(void)
{
    if (s_n32_lptim_clock_hz == 0u) {
        return 0u;
    }
    return (uint32_t)((65535ULL * 1000ULL) / s_n32_lptim_clock_hz);
}

void xy_hal_n32l40x_after_stop_restore_clock(void)
{
    RCC_EnableHsi(ENABLE);
    (void)RCC_WaitHsiStable();
    RCC_ConfigHclk(RCC_SYSCLK_DIV1);
    RCC_ConfigPclk2(RCC_HCLK_DIV4);
    RCC_ConfigPclk1(RCC_HCLK_DIV4);
    RCC_ConfigPll(RCC_PLL_HSI_PRE_DIV2, RCC_PLL_MUL_12, RCC_PLLDIVCLK_ENABLE);
    RCC_EnablePll(ENABLE);
    while (RCC_GetFlagStatus(RCC_CTRL_FLAG_PLLRDF) != SET) {
    }
    FLASH_PrefetchBufSet(FLASH_PrefetchBuf_DIS);
    FLASH_iCacheCmd(FLASH_iCache_EN);
    FLASH_SetLatency(FLASH_LATENCY_1);
    RCC_ConfigSysclk(RCC_SYSCLK_SRC_PLLCLK);
    while (RCC_GetSysclkSrc() != 0x0c) {
    }
    SystemCoreClockUpdate();
}

static void usbfs_interrupts_config(void)
{
    NVIC_InitType NVIC_InitStructure;
    EXTI_InitType EXTI_InitStructure;

    NVIC_InitStructure.NVIC_IRQChannel = USB_LP_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    NVIC_InitStructure.NVIC_IRQChannel = USBWakeUp_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    EXTI_ClrITPendBit(EXTI_LINE17);
    EXTI_InitStruct(&EXTI_InitStructure);
    EXTI_InitStructure.EXTI_Line = EXTI_LINE17;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_InitPeripheral(&EXTI_InitStructure);
}

static void n32_uart5_secboot_irq_enable(void)
{
    NVIC_InitType NVIC_InitStructure;

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
    NVIC_InitStructure.NVIC_IRQChannel = UART5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

void SysTick_Delayms(uint32_t Delayms)
{
    uint32_t tickstart = mwTick;
    uint32_t last_tick = tickstart;
    uint32_t stalled_loops = 0;
    uint32_t wait=Delayms;
    /* Add 1 to guarantee minimum wait */
    if (wait < 0xFFFFFFFFU)
    {
        wait +=1;
    }
    while ((mwTick - tickstart) < wait)
    {
        IWDG_ReloadKey();
        if (mwTick != last_tick) {
            last_tick = mwTick;
            stalled_loops = 0;
        } else if (++stalled_loops >= 2000000U) {
            break;
        }
    }
}
 /**
 *@name  DMA_SetPerMemAddr.
 *@brief Set peripher address and memory address of DMA
 *@param DMAChx (The input parameters must be the following values):
 *          - DMA_CH1
 *          - DMA_CH2
 *          - DMA_CH3
 *          - DMA_CH4
 *          - DMA_CH5
 *          - DMA_CH6
 *          - DMA_CH7
 *          - DMA_CH8
 *@param periphAddr   peripher address
 *@param memAddr   memory address
 *@param bufSize   buff size
 *@return status
 */
 void DMA_SetPerMemAddr(DMA_ChannelType* DMAChx, uint32_t periphAddr,uint32_t memAddr,uint32_t bufSize )
 {
     /* DMAy Channelx TXNUM Configuration */
    /* Write to DMAy Channelx TXNUM */
    DMAChx->TXNUM = bufSize;

    /* DMAy Channelx PADDR Configuration */
    /* Write to DMAy Channelx PADDR */
    DMAChx->PADDR = periphAddr;

    /* DMAy Channelx MADDR Configuration */
    /* Write to DMAy Channelx MADDR */
    DMAChx->MADDR = memAddr;
 }
/* NTFx CODE END */

void n32_debug_log_char(char ch)
{
    if (ch == '\n') {
        n32_debug_log_char('\r');
    }

    while (USART_GetFlagStatus(UART4, USART_FLAG_TXDE) == RESET) {
    }
    USART_SendData(UART4, (uint16_t)ch);
    g_n32_debug_log_last_char = (uint8_t)ch;
    g_n32_debug_log_tx_count++;
}

void n32_debug_log_write(const char *str)
{
    while (*str != '\0') {
        n32_debug_log_char(*str++);
    }
}

void xy_log_char(char ch)
{
    n32_debug_log_char(ch);
}

void n32_uart5_secboot_send_char(char ch)
{
    while (USART_GetFlagStatus(UART5, USART_FLAG_TXDE) == RESET) {
    }
    USART_SendData(UART5, (uint16_t)ch);
    g_n32_uart5_tx_count++;
}

void n32_uart5_secboot_write_str(const char *str)
{
    while (*str != '\0') {
        n32_uart5_secboot_send_char(*str++);
    }
}

void n32_uart5_secboot_init(void)
{
    xy_rb_init(&s_uart5_rx_rb, s_uart5_rx_pool, (int32_t)sizeof(s_uart5_rx_pool));
    USART_EnableDMA(UART5, USART_DMAREQ_RX, DISABLE);
    while (USART_GetFlagStatus(UART5, USART_FLAG_RXDNE) == SET) {
        (void)USART_ReceiveData(UART5);
    }
    USART_ConfigInt(UART5, USART_INT_RXDNE, ENABLE);
    USART_ConfigInt(UART5, USART_INT_ERRF, ENABLE);
    n32_uart5_secboot_irq_enable();
}

void n32_uart5_secboot_poll(void)
{
    g_n32_uart5_rb_pending = (uint32_t)xy_rb_data_len(&s_uart5_rx_rb);
}

int n32_uart5_secboot_read(uint8_t *data, size_t len, uint32_t timeout_ms)
{
    uint32_t start;
    size_t count = 0U;

    if ((data == NULL) && (len != 0U)) {
        return -1;
    }

    start = mwTick;
    while (count < len) {
        if (xy_rb_getchar(&s_uart5_rx_rb, &data[count]) == 1U) {
            count++;
            continue;
        }

        if ((int32_t)(mwTick - start) >= (int32_t)timeout_ms) {
            break;
        }
        IWDG_ReloadKey();
    }

    g_n32_uart5_rb_pending = (uint32_t)xy_rb_data_len(&s_uart5_rx_rb);
    return (int)count;
}

int n32_uart5_secboot_write(const uint8_t *data, size_t len, uint32_t timeout_ms)
{
    uint32_t start;
    size_t count = 0U;

    if ((data == NULL) && (len != 0U)) {
        return -1;
    }

    start = mwTick;
    while (count < len) {
        if (USART_GetFlagStatus(UART5, USART_FLAG_TXDE) == SET) {
            USART_SendData(UART5, (uint16_t)data[count]);
            g_n32_uart5_tx_count++;
            count++;
            start = mwTick;
            continue;
        }

        if ((int32_t)(mwTick - start) >= (int32_t)timeout_ms) {
            break;
        }
        IWDG_ReloadKey();
    }

    return (int)count;
}

void n32_uart5_secboot_isr(void)
{
    if (USART_GetIntStatus(UART5, USART_INT_RXDNE) == SET) {
        uint8_t ch = (uint8_t)USART_ReceiveData(UART5);
        g_n32_uart5_last_rx = ch;
        g_n32_uart5_rx_count++;
        if (xy_rb_putchar(&s_uart5_rx_rb, ch) == 0U) {
            g_n32_uart5_rx_drop_count++;
        }
    }

    if ((USART_GetFlagStatus(UART5, USART_FLAG_OREF) == SET)
        || (USART_GetFlagStatus(UART5, USART_FLAG_NEF) == SET)
        || (USART_GetFlagStatus(UART5, USART_FLAG_FEF) == SET)
        || (USART_GetFlagStatus(UART5, USART_FLAG_PEF) == SET)) {
        (void)UART5->STS;
        (void)UART5->DAT;
    }
}

int fputc(int ch, FILE *f)
{
    (void)f;
    n32_debug_log_char((char)ch);
    return ch;
}

int _write(int file, char *ptr, int len)
{
    int i;

    (void)file;
    for (i = 0; i < len; i++) {
        n32_debug_log_char(ptr[i]);
    }
    return len;
}

/* NTFx CODE START */
/**
 *@brief Initializes the clock tree
 *@param null
 *@return status
 */
bool RCC_Configuration(void)
{
    ErrorStatus ClockStatus;
    uint32_t timeout;
    RCC_DeInit();
    RCC_ConfigHclk(RCC_SYSCLK_DIV1);
    RCC_ConfigPclk2(RCC_HCLK_DIV4);
    RCC_ConfigPclk1(RCC_HCLK_DIV4);
     
    RCC_EnableHsi(ENABLE);
    /* Wait till HSI is ready */
    ClockStatus = RCC_WaitHsiStable();
    if (ClockStatus != SUCCESS) return false;
     
