ZeroZap/BareOS/project/PLB -N32/USER/src/n32l40x_cfg.c
    /* PLB-N32 uses HSI PLL: 16MHz / 2 * 12 / 2 = 48MHz SYSCLK.
     * HSE is not used, so do not wait for HSERDF after disabling it. */
    RCC_ConfigHse(RCC_HSE_DISABLE);
     
    /* Enable PWR peripheral clock */
    RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_PWR, ENABLE);
    /* Enable access to backup registers */
    PWR_BackupAccessEnable(ENABLE);
    
    /* Enable LSI */
    RCC_EnableLsi(ENABLE);
    /* Wait till LSI is ready */
    while (RCC_GetFlagStatus(RCC_CTRLSTS_FLAG_LSIRD) == RESET);
     
    RCC_ConfigLse(RCC_LSE_ENABLE,0x1FF);
    /* Do not block UART bring-up forever if the 32.768 kHz crystal is absent or slow. */
    timeout = 0x20000U;
    while ((RCC_GetFlagStatus(RCC_LDCTRL_FLAG_LSERD) != SET) && (timeout-- > 0U));
     
    RCC_ConfigPll(RCC_PLL_HSI_PRE_DIV2,RCC_PLL_MUL_12,RCC_PLLDIVCLK_ENABLE);
    /* Enable PLL */
    RCC_EnablePll(ENABLE);
    /* Wait till PLL is ready */
    while (RCC_GetFlagStatus(RCC_CTRL_FLAG_PLLRDF) != SET);
     
    /* Disable Prefetch Buffer */
    FLASH_PrefetchBufSet(FLASH_PrefetchBuf_DIS);
    /* Enable iCache */
    FLASH_iCacheCmd(FLASH_iCache_EN);
    /* Flash wait state */
    FLASH_SetLatency(FLASH_LATENCY_1);
     
    /*selsect HSI as RCC ADC1M CLK Source*/
    RCC_ConfigAdc1mClk(RCC_ADC1MCLK_SRC_HSI, RCC_ADC1MCLK_DIV16);  
    RCC_ConfigAdcPllClk(RCC_ADCPLLCLK_DIV2,ENABLE);
    RCC_ConfigAdcHclk(RCC_ADCHCLK_DIV1);
     
    /*config RNG clock*/
    RCC_ConfigTrng1mClk(RCC_TRNG1MCLK_SRC_HSI, RCC_TRNG1MCLK_DIV16);
    RCC_EnableTrng1mClk(ENABLE);
    RCC_ConfigRngcClk(RCC_RNGCCLK_SYSCLK_DIV1);
     
    /* Prefer the accurate LSE for tickless; fall back to LSI if unavailable. */
    if (RCC_GetFlagStatus(RCC_LDCTRL_FLAG_LSERD) == SET) {
        RCC_ConfigLPTIMClk(RCC_LPTIMCLK_SRC_LSE);
        s_n32_lptim_clock_hz = 32768u;
    } else {
        RCC_ConfigLPTIMClk(RCC_LPTIMCLK_SRC_LSI);
        s_n32_lptim_clock_hz = PLB_N32_LSI_HZ;
    }
    RCC_EnableRETPeriphClk(RCC_RET_PERIPH_LPTIM,ENABLE);
     
    /*config RTC clock*/
    if (RCC_GetFlagStatus(RCC_LDCTRL_FLAG_LSERD) == SET) {
        RCC_ConfigRtcClk(RCC_RTCCLK_SRC_LSE);
    } else {
        RCC_ConfigRtcClk(RCC_RTCCLK_SRC_LSI);
    }
    RCC_EnableRtcClk(ENABLE);
     
    /*config USB clock*/
    RCC_ConfigUSBXTALESSMode(RCC_USBXTALESS_LESSMODE);
    RCC_ConfigUCDRClk(RCC_UCDR300M_SRC_OSC300M, ENABLE);
    RCC_ConfigUsbClk(RCC_USBCLK_SRC_PLLCLK_DIV1);
     
    /* Select PLLCLK as system clock source */
    RCC_ConfigSysclk(RCC_SYSCLK_SRC_PLLCLK);
    /* Wait till PLLCLK is used as system clock source */
    while (RCC_GetSysclkSrc() != 0x0c) ;
    SystemCoreClockUpdate();
    /*  Configure the SysTick to have interrupt in 1ms time basis*/
    SysTick_Config(SystemCoreClock / 1000u);
    NVIC_SetPriority(SysTick_IRQn, 0);
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the NVIC
 *@param null
 *@return status
 */
bool NVIC_Configuration(void)
{
    NVIC_InitType NVIC_InitStructure;
    /*Configure the preemption priority and subpriority:
    - 4 bits for pre-emption priority: possible value are 0..15
    - 0 bits for subpriority: possible value are 0
    - Lower values gives higher priority
    */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
    
    /*Set EXTI1  interrupt priority*/
    NVIC_InitStructure.NVIC_IRQChannel                   =EXTI1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority =8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        =0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    /*Set DMA_Channel1  interrupt priority*/
    NVIC_InitStructure.NVIC_IRQChannel                   =DMA_Channel1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority =8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        =0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    /*Set USB_LP  interrupt priority*/
    NVIC_InitStructure.NVIC_IRQChannel                   =USB_LP_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority =8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        =0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    /*Set USART1  interrupt priority*/
    NVIC_InitStructure.NVIC_IRQChannel                   =USART1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority =8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        =0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    /*Set USART2  interrupt priority*/
    NVIC_InitStructure.NVIC_IRQChannel                   =USART2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority =8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        =0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    /*Set USBWakeUp  interrupt priority*/
    NVIC_InitStructure.NVIC_IRQChannel                   =USBWakeUp_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority =8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        =0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    /*Set UART4  interrupt priority*/
    NVIC_InitStructure.NVIC_IRQChannel                   =UART4_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority =8;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        =0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the DMA
 *@param null
 *@return status
 */
bool DMA_Configuration(void)
{
    DMA_InitType DMA_InitStructure;
    DMA_StructInit(&DMA_InitStructure);
     
    /* Enable DMA clock */
    RCC_EnableAHBPeriphClk(RCC_AHB_PERIPH_DMA,ENABLE);
    /*USART2.RX---DMA1.CH1 DMA configuration*/
    DMA_DeInit(DMA_CH1);
    //DMA_InitStructure.PeriphAddr     = (uint32_t)&USART2->DAT;
    //DMA_InitStructure.MemAddr        = (uint32_t)USART2_RX_Mem;
    //DMA_InitStructure.BufSize        = DMA1_CH1_BufSize;//set it by DMA_SetPerMemAddr(DMA_CH1,&USART2->DAT,USART2_RX_Mem,DMA_CH1_BufSize)
    DMA_InitStructure.Direction      = DMA_DIR_PERIPH_SRC;
    DMA_InitStructure.PeriphInc      = DMA_PERIPH_INC_DISABLE;
    DMA_InitStructure.DMA_MemoryInc  = DMA_MEM_INC_ENABLE;
    DMA_InitStructure.PeriphDataSize = DMA_PERIPH_DATA_SIZE_BYTE;
    DMA_InitStructure.MemDataSize    = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.CircularMode   = DMA_MODE_NORMAL;
    DMA_InitStructure.Priority       = DMA_PRIORITY_LOW;
    DMA_InitStructure.Mem2Mem        = DMA_M2M_DISABLE;
    DMA_Init(DMA_CH1, &DMA_InitStructure);
    
