ZeroZap/BareOS/project/PLB -N32/USER/src/n32l40x_cfg.c
    DMA_RequestRemap(DMA_REMAP_USART2_RX,DMA,DMA_CH1,ENABLE);
     
    /*USART1.RX---DMA1.CH2 DMA configuration*/
    DMA_DeInit(DMA_CH2);
    //DMA_InitStructure.PeriphAddr     = (uint32_t)&USART1->DAT;
    //DMA_InitStructure.MemAddr        = (uint32_t)USART1_RX_Mem;
    //DMA_InitStructure.BufSize        = DMA1_CH2_BufSize;//set it by DMA_SetPerMemAddr(DMA_CH2,&USART1->DAT,USART1_RX_Mem,DMA_CH2_BufSize)
    DMA_InitStructure.PeriphInc      = DMA_PERIPH_INC_DISABLE;
    DMA_InitStructure.DMA_MemoryInc  = DMA_MEM_INC_ENABLE;
    DMA_InitStructure.PeriphDataSize = DMA_PERIPH_DATA_SIZE_BYTE;
    DMA_InitStructure.MemDataSize    = DMA_MemoryDataSize_Byte;
    DMA_Init(DMA_CH2, &DMA_InitStructure);
    
    DMA_RequestRemap(DMA_REMAP_USART1_RX,DMA,DMA_CH2,ENABLE);
     
    /*USART3.RX---DMA1.CH3 DMA configuration*/
    DMA_DeInit(DMA_CH3);
    //DMA_InitStructure.PeriphAddr     = (uint32_t)&USART3->DAT;
    //DMA_InitStructure.MemAddr        = (uint32_t)USART3_RX_Mem;
    //DMA_InitStructure.BufSize        = DMA1_CH3_BufSize;//set it by DMA_SetPerMemAddr(DMA_CH3,&USART3->DAT,USART3_RX_Mem,DMA_CH3_BufSize)
    DMA_InitStructure.PeriphInc      = DMA_PERIPH_INC_DISABLE;
    DMA_InitStructure.DMA_MemoryInc  = DMA_MEM_INC_ENABLE;
    DMA_InitStructure.PeriphDataSize = DMA_PERIPH_DATA_SIZE_BYTE;
    DMA_InitStructure.MemDataSize    = DMA_MemoryDataSize_Byte;
    DMA_Init(DMA_CH3, &DMA_InitStructure);
    
    DMA_RequestRemap(DMA_REMAP_USART3_RX,DMA,DMA_CH3,ENABLE);
     
    /*UART5.RX---DMA1.CH4 DMA configuration*/
    DMA_DeInit(DMA_CH4);
    //DMA_InitStructure.PeriphAddr     = (uint32_t)&UART5->DAT;
    //DMA_InitStructure.MemAddr        = (uint32_t)UART5_RX_Mem;
    //DMA_InitStructure.BufSize        = DMA1_CH4_BufSize;//set it by DMA_SetPerMemAddr(DMA_CH4,&UART5->DAT,UART5_RX_Mem,DMA_CH4_BufSize)
    DMA_InitStructure.PeriphInc      = DMA_PERIPH_INC_DISABLE;
    DMA_InitStructure.DMA_MemoryInc  = DMA_MEM_INC_ENABLE;
    DMA_InitStructure.PeriphDataSize = DMA_PERIPH_DATA_SIZE_BYTE;
    DMA_InitStructure.MemDataSize    = DMA_MemoryDataSize_Byte;
    DMA_Init(DMA_CH4, &DMA_InitStructure);
    
    DMA_RequestRemap(DMA_REMAP_UART5_RX,DMA,DMA_CH4,ENABLE);
     
    /* Clear DMA Channel1 interrupt flag*/
    DMA_ClearFlag(DMA_FLAG_TC1|DMA_FLAG_HT1|DMA_FLAG_TE1, DMA);
    /* Enable DMA Channel1TXC|HTX|ERR interrupt */
    DMA_ConfigInt(DMA_CH1,DMA_INT_TXC|DMA_INT_HTX|DMA_INT_ERR, ENABLE);
     
    /* Use reference:  need to  set Address and enable DMA after at appropriate place 
     * DMA_SetPerMemAddr(......);
     * DMA_EnableChannel(DMA_CH1, ENABLE);
     * DMA_EnableChannel(DMA_CH2, ENABLE);
     * DMA_EnableChannel(DMA_CH3, ENABLE);
     * DMA_EnableChannel(DMA_CH4, ENABLE);
     * */
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the GPIO
 *@param null
 *@return status
 */
bool GPIO_Configuration(void)
{
    GPIO_InitType GPIO_InitStructure;
    EXTI_InitType EXTI_InitStructure;
    GPIO_InitStruct(&GPIO_InitStructure);
    EXTI_InitStruct(&EXTI_InitStructure);
     
    /* Enable the GPIO clock*/
    RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOD | RCC_APB2_PERIPH_GPIOA | RCC_APB2_PERIPH_GPIOB | RCC_APB2_PERIPH_GPIOC | RCC_APB2_PERIPH_AFIO, ENABLE);
    
     
    GPIO_SetBits(GPIOA,GPIO_PIN_0 | GPIO_PIN_4 | GPIO_PIN_8 | GPIO_PIN_15);
    GPIO_SetBits(GPIOB,GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_12 | GPIO_PIN_15);
    GPIO_SetBits(GPIOD,GPIO_PIN_14 | GPIO_PIN_15);
    GPIO_SetBits(GPIOC,GPIO_PIN_13);
     
    /*Initialize AF_PP GPIO */
    GPIO_InitStructure.GPIO_Mode      = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Pull      = GPIO_No_Pull;
    GPIO_InitStructure.GPIO_Slew_Rate = GPIO_Slew_Rate_Low;
    GPIO_InitStructure.GPIO_Current   = GPIO_DC_2mA;
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF0_SPI1;
    GPIO_InitStructure.Pin            = GPIO_PIN_7 | GPIO_PIN_6 | GPIO_PIN_5;
    GPIO_InitPeripheral(GPIOA,&GPIO_InitStructure);
     
    GPIO_InitStructure.GPIO_Pull      = GPIO_Pull_Up;
    GPIO_InitStructure.GPIO_Slew_Rate = GPIO_Slew_Rate_Low;
    GPIO_InitStructure.GPIO_Current   = GPIO_DC_2mA;
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF4_USART2;
    GPIO_InitStructure.Pin            = GPIO_PIN_2;
    GPIO_InitPeripheral(GPIOA,&GPIO_InitStructure);
     
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF4_USART1;
    GPIO_InitStructure.Pin            = GPIO_PIN_9;
    GPIO_InitPeripheral(GPIOA,&GPIO_InitStructure);
     
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF6_UART4;
    GPIO_InitStructure.Pin            = GPIO_PIN_0;
    GPIO_InitPeripheral(GPIOB,&GPIO_InitStructure);
     
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF6_UART5;
    GPIO_InitStructure.Pin            = GPIO_PIN_8;
    GPIO_InitPeripheral(GPIOB,&GPIO_InitStructure);
     
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF0_USART3;
    GPIO_InitStructure.Pin            = GPIO_PIN_10;
    GPIO_InitPeripheral(GPIOB,&GPIO_InitStructure);
     
    /*Initialize Out_PP GPIO */
    GPIO_InitStructure.GPIO_Mode      = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Pull      = GPIO_Pull_Up;
    GPIO_InitStructure.GPIO_Slew_Rate = GPIO_Slew_Rate_Low;
    GPIO_InitStructure.GPIO_Current   = GPIO_DC_2mA;
    GPIO_InitStructure.GPIO_Alternate = GPIO_NO_AF;
    GPIO_InitStructure.Pin            = GPIO_PIN_0 | GPIO_PIN_4 | GPIO_PIN_8 | GPIO_PIN_15;
    GPIO_InitPeripheral(GPIOA,&GPIO_InitStructure);
     
    GPIO_InitStructure.Pin            = GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_12 | GPIO_PIN_15;
    GPIO_InitPeripheral(GPIOB,&GPIO_InitStructure);
     
    GPIO_InitStructure.Pin            = GPIO_PIN_14 | GPIO_PIN_15;
    GPIO_InitPeripheral(GPIOD,&GPIO_InitStructure);
     
    GPIO_InitStructure.Pin            = GPIO_PIN_13;
    GPIO_InitPeripheral(GPIOC,&GPIO_InitStructure);
     
    /*Initialize input GPIO */
    GPIO_InitStructure.GPIO_Mode      = GPIO_Mode_Input;
    GPIO_InitStructure.GPIO_Pull      = GPIO_Pull_Up;
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF4_USART2;
    GPIO_InitStructure.Pin            = GPIO_PIN_3;
    GPIO_InitPeripheral(GPIOA,&GPIO_InitStructure);
     
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF4_USART1;
    GPIO_InitStructure.Pin            = GPIO_PIN_10;
    GPIO_InitPeripheral(GPIOA,&GPIO_InitStructure);
     
