ZeroZap/BareOS/project/PLB -N32/USER/src/n32l40x_cfg.c
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF6_UART4;
    GPIO_InitStructure.Pin            = GPIO_PIN_1;
    GPIO_InitPeripheral(GPIOB,&GPIO_InitStructure);
     
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF6_UART5;
    GPIO_InitStructure.Pin            = GPIO_PIN_9;
    GPIO_InitPeripheral(GPIOB,&GPIO_InitStructure);
     
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF5_USART3;
    GPIO_InitStructure.Pin            = GPIO_PIN_11;
    GPIO_InitPeripheral(GPIOB,&GPIO_InitStructure);
     
    /*Initialize AF_OD GPIO */
    GPIO_InitStructure.GPIO_Mode      = GPIO_Mode_AF_OD;
    GPIO_InitStructure.GPIO_Pull      = GPIO_Pull_Up;
    GPIO_InitStructure.GPIO_Slew_Rate = GPIO_Slew_Rate_Low;
    GPIO_InitStructure.GPIO_Current   = GPIO_DC_2mA;
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF1_I2C1;
    GPIO_InitStructure.Pin            = GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_InitPeripheral(GPIOB,&GPIO_InitStructure);
     
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF5_I2C2;
    GPIO_InitStructure.Pin            = GPIO_PIN_13 | GPIO_PIN_14;
    GPIO_InitPeripheral(GPIOB,&GPIO_InitStructure);
     
    /*config exti gpio */
    GPIO_InitStructure.GPIO_Slew_Rate = GPIO_Slew_Rate_High;
    GPIO_InitStructure.GPIO_Mode      = GPIO_Mode_Input;
    GPIO_InitStructure.GPIO_Current   = GPIO_DC_2mA;
    GPIO_InitStructure.GPIO_Alternate = GPIO_NO_AF;
    GPIO_InitStructure.GPIO_Pull      = GPIO_Pull_Down;
    GPIO_InitStructure.Pin            = GPIO_PIN_1;
    GPIO_InitPeripheral(GPIOA,&GPIO_InitStructure);
     
     
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_Mode    = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_InitStructure.EXTI_Line    = EXTI_LINE1;
    EXTI_InitPeripheral(&EXTI_InitStructure);
    /*Initialize  GPIO EXTI function PA1.EXTI1*/
    GPIO_ConfigEXTILine(GPIOA_PORT_SOURCE, GPIO_PIN_SOURCE1);
     
    /*config the EXTI17 ,EXTI17 connect to USBFS weakup*/
    EXTI_InitStructure.EXTI_Line    = EXTI_LINE17;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_Mode    = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_InitPeripheral(&EXTI_InitStructure);
     
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the USART
 *@param null
 *@return status
 */
bool USART_Configuration(void)
{
    USART_InitType USART_InitStructure;
    USART_StructInit(&USART_InitStructure);
    /* Enable UART4|UART5|USART1 clock */
    RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_UART4|RCC_APB2_PERIPH_UART5|RCC_APB2_PERIPH_USART1,ENABLE);
    /* Enable USART2|USART3 clock */
    RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_USART2|RCC_APB1_PERIPH_USART3,ENABLE);
     
     
    /*********initialize the USART1************/
    USART_InitStructure.BaudRate            = 115200;
    USART_InitStructure.WordLength          = USART_WL_8B;
    USART_InitStructure.StopBits            = USART_STPB_1;
    USART_InitStructure.Parity              = USART_PE_NO; 
    USART_InitStructure.HardwareFlowControl = USART_HFCTRL_NONE; 
    USART_InitStructure.Mode                = USART_MODE_RX | USART_MODE_TX; 
    /* Configure USART1 */
    USART_Init(USART1, &USART_InitStructure);
     
     
    /* RX DMA is disabled; receive paths use RXDNE interrupt plus ring buffer. */
    USART_ConfigInt(USART1,USART_INT_IDLEF,DISABLE);
    USART_EnableDMA(USART1,USART_DMAREQ_RX, DISABLE);
    /* Enable the USART1 */
    USART_Enable(USART1, ENABLE);
     
    /*********initialize the USART2************/
    /* Configure USART2 */
    USART_Init(USART2, &USART_InitStructure);
     
     
    USART_ConfigInt(USART2,USART_INT_IDLEF,DISABLE);
     
    /* Enable USART2 ERRF interrupt*/
    USART_ConfigInt(USART2,USART_INT_ERRF,ENABLE);
    USART_EnableDMA(USART2,USART_DMAREQ_RX, DISABLE);
    /* Enable the USART2 */
    USART_Enable(USART2, ENABLE);
     
    /*********initialize the USART3************/
    /* Configure USART3 */
    USART_Init(USART3, &USART_InitStructure);
     
    USART_EnableDMA(USART3,USART_DMAREQ_RX, DISABLE);
    /* Enable the USART3 */
    USART_Enable(USART3, ENABLE);
     
    /*********initialize the UART4************/
    /* Configure UART4 */
    USART_Init(UART4, &USART_InitStructure);
     
     
    /* UART4 is reserved for blocking debug log output on PB0/PB1. */
    USART_ConfigInt(UART4,USART_INT_IDLEF,DISABLE);
    /* Enable the UART4 */
    USART_Enable(UART4, ENABLE);
     
    /*********initialize the UART5************/
    /* Configure UART5 */
    USART_Init(UART5, &USART_InitStructure);
     
    USART_EnableDMA(UART5,USART_DMAREQ_RX, DISABLE);
    /* Enable the UART5 */
    USART_Enable(UART5, ENABLE);
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the LPTIM
 *@param null
 *@return status
 */
bool LPTIM_Configuration(void)
{
    xy_hal_lptimer_config_t config;
    
/* NTFx CODE END */
    config.clock_hz = n32_lptim_clock_hz();
    config.mode = XY_HAL_LPTIMER_ONESHOT;
    config.run_in_stop = true;
    config.wakeup = true;
    config.priority = 1u;

    return xy_hal_lptimer_init(LPTIM, &config) == XY_HAL_OK;
}
/* NTFx CODE START */
/**
 *@brief Initializes the RTC
 *@param null
 *@return status
 */
bool RTC_Configuration(void)
{
    RTC_InitType  RTC_InitStructure;
    /* Enable the RTC clock */
    
    
    RCC_EnableRtcClk(ENABLE);
    RTC_WaitForSynchro();
    /* Config RTC Peripheral */
    RTC_StructInit(&RTC_InitStructure);
    /* Configure the RTC data register and RTC prescaler */
    RTC_InitStructure.RTC_AsynchPrediv = 127;
    RTC_InitStructure.RTC_SynchPrediv  = 255;
    RTC_InitStructure.RTC_HourFormat   = RTC_24HOUR_FORMAT;
    if(RTC_Init(&RTC_InitStructure) == ERROR)
    {
        return false;
    }
     
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the IWDG
 *@param null
 *@return status
 */
bool IWDG_Configuration(void)
{
    IWDG_WriteConfig(IWDG_WRITE_ENABLE);
    IWDG_SetPrescalerDiv(IWDG_PRESCALER_DIV256);
    IWDG_CntReload(0x0fff);
    while (IWDG_GetStatus(IWDG_PVU_FLAG) == SET || IWDG_GetStatus(IWDG_CRVU_FLAG) == SET) {
    }
    IWDG_ReloadKey();
    IWDG_WriteConfig(IWDG_WRITE_DISABLE);
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the ADC
 *@param null
 *@return status
 */
bool ADC_Configuration(void)
{
     
    /* EnableADCclock */
    RCC_EnableAHBPeriphClk(RCC_AHB_PERIPH_ADC,ENABLE);
    /***************** ADC configuration ***************/
    
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the USB
 *@param null
 *@return status
 */
bool USBFS_Configuration(void)
{
    /* Enable the USB clock */
    RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_USB, ENABLE);
    usbfs_interrupts_config();
     
    /***************** USBFS configuration ***************/
    USB_Init();
    //Use reference:
    //USBdevice_Tramsmit(USBdeviceType USBdevice,uint8_t * TxBuff, uint16_t Length,uint8_t buffNum);to tramsmit data
    //USBdevice_PrepareReceive(USBdeviceType USBdevice,uint8_t * RxBuff, uint16_t Length);to receive data and Set the length and buffer you want to receive
    //Mass Storage Device: need perfect the read and write function in usbfsd_storage_flash_driver.c file
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the SPI
 *@param null
 *@return status
 */
bool SPI_Configuration(void)
{
    SPI_InitType SPI_InitStructure;
    SPI_InitStruct(&SPI_InitStructure);
    /* Enable SPI1 clock */
    RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_SPI1,ENABLE);
    /***************** SPI1 configuration ***************/
    SPI_InitStructure.DataDirection = SPI_DIR_DOUBLELINE_FULLDUPLEX;
    SPI_InitStructure.SpiMode       = SPI_MODE_MASTER;
    SPI_InitStructure.DataLen       = SPI_DATA_SIZE_8BITS;
    SPI_InitStructure.CLKPOL        = SPI_CLKPOL_LOW;
    SPI_InitStructure.CLKPHA        = SPI_CLKPHA_FIRST_EDGE;
    SPI_InitStructure.NSS           = SPI_NSS_SOFT;
    SPI_InitStructure.BaudRatePres  = SPI_BR_PRESCALER_256;
    SPI_InitStructure.FirstBit      = SPI_FB_MSB;
    SPI_InitStructure.CRCPoly       = 7;
    SPI_Init(SPI1, &SPI_InitStructure);
     
    /* config DISABLE CRC*/
    SPI_EnableCalculateCrc( SPI1,DISABLE);
     
     
    /* Enable SPI1*/
    SPI_Enable(SPI1,ENABLE);
/* NTFx CODE END */
    return true;
}
/* NTFx CODE START */
/**
 *@brief Initializes the I2C
 *@param null
 *@return status
 */
bool I2C_Configuration(void)
{
    I2C_InitType I2C_InitStructure;
    I2C_InitStruct(&I2C_InitStructure);
     
    /* Enable I2C1|I2C2 clock */
    RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_I2C1|RCC_APB1_PERIPH_I2C2,ENABLE);
    
     
    /*********************** I2C1 configuration *********************/
     
    I2C_DeInit(I2C1);
    /*init I2C1 */
    I2C_InitStructure.BusMode     = I2C_BUSMODE_I2C;
    I2C_InitStructure.OwnAddr1     = 0x0;
    I2C_InitStructure.AckEnable   = I2C_ACKEN;
    I2C_InitStructure.AddrMode    = I2C_ADDR_MODE_7BIT;
    I2C_InitStructure.ClkSpeed    = 100000;
    I2C_Init(I2C1,&I2C_InitStructure);
     
    /*Enables  the specified I2C Clock stretching*/
    I2C_EnableExtendClk(I2C1,ENABLE);
     
    I2C_Enable(I2C1,ENABLE);
     
    /*********************** I2C2 configuration *********************/
     
    I2C_DeInit(I2C2);
    /*init I2C2 */
    I2C_Init(I2C2,&I2C_InitStructure);
     
    /*Enables  the specified I2C Clock stretching*/
    I2C_EnableExtendClk(I2C2,ENABLE);
     
    I2C_Enable(I2C2,ENABLE);
    //Use reference:
    //I2C_GenerateStart(I2C1, ENABLE);
    //I2C_SendAddr7bit(I2C1, I2C_SLAVE_ADDR, I2C_DIRECTION_SEND); 
    //I2C_SendData(I2C1, *sendBufferPtr++);
    //I2C_GenerateStop(I2C1, ENABLE);
     
/* NTFx CODE END */
    return true;
}
